tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
# Search tool like grep, but optimized for programmers
brew "ack"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum"
# NCurses Disk Usage
brew "ncdu"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Distributed search & analytics engine
cask "1password"
cask "1password-cli"
cask "docker"
cask "google-chrome"
cask "skype"
cask "visual-studio-code"
cask "zoom"
mas "1Blocker", id: 1107421413
mas "GarageBand", id: 682658836
mas "Hue Menu Bar", id: 1500678169
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "Tweetbot", id: 1384080005
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835